tap "gigalixir/brew"
tap "github/gh"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "aalib"
brew "ack"
brew "antibody"
brew "readline"
brew "xz"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "asdf"
brew "astyle"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "bat"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "carthage"
brew "certbot"
brew "clang-format"
brew "cmake"
brew "cocoapods"
brew "cpanminus"
brew "ctags"
brew "w3m"
brew "wget"
brew "dasht"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docker-machine", restart_service: true
brew "libev"
brew "openjdk"
brew "emscripten"
brew "exa"
brew "fasd"
brew "fd"
brew "figlet"
brew "fzf"
brew "fzy"
brew "geoip"
brew "geoipupdate"
brew "gh"
brew "gist"
brew "git-lfs"
brew "gmp"
brew "gnu-tar"
brew "gnupg"
brew "msgpack"
brew "groonga"
brew "harfbuzz"
brew "jpeg-turbo"
brew "hashlink"
brew "haxe"
brew "htop"
brew "httpd"
brew "httpie"
brew "libheif"
brew "imagemagick"
brew "imagemagick@6"
brew "jq"
brew "lazygit"
brew "pango"
brew "librsvg"
brew "mas"
brew "mkcert"
brew "mono"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nss"
brew "ocaml"
brew "opam"
brew "perl"
brew "postgresql", restart_service: true
brew "putty"
brew "ranger"
brew "rename"
brew "ripgrep"
brew "sd"
brew "shpotify"
brew "sk"
brew "stow"
brew "task"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "tree-sitter"
brew "tty-clock"
brew "watch"
brew "watchexec"
brew "watchman"
brew "wxmac"
brew "yarn"
brew "zlib"
brew "zsh"
brew "gigalixir/brew/gigalixir"
brew "hashicorp/tap/terraform-ls"
brew "heroku/brew/heroku"
cask "1password"
cask "alfred"
cask "amethyst"
cask "appcleaner"
cask "aptible"
cask "aws-vault"
cask "bartender"
cask "blender"
cask "cleanshot"
cask "daisydisk"
cask "dash"
cask "discord"
cask "dotnet-sdk"
cask "dropbox"
cask "fantastical"
cask "figma"
cask "firefox"
cask "flipper"
cask "godot"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "harvest"
cask "insomnia"
cask "istat-menus"
cask "itch"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "libreoffice"
cask "ngrok"
cask "obsidian"
cask "paw"
cask "postico"
cask "postman"
cask "react-native-debugger"
cask "reaper"
cask "rightfont"
cask "sketch"
cask "slack"
cask "spotify"
cask "statusfy"
cask "steam"
cask "sublime-text"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "xscreensaver"
cask "zoomus"
mas "Boop", id: 1518425043
mas "Entity Pro", id: 1503988785
mas "GarageBand", id: 682658836
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Things", id: 904280696
mas "Xcode", id: 497799835
