tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "cocoapods"
brew "mas"
brew "shpotify"
brew "trash"

cask "1password"
cask "1password-cli"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "alfred"
cask "amethyst"
cask "android-sdk"
cask "android-studio"
cask "appcleaner"
cask "aptible"
cask "bartender"
cask "blender"
cask "cleanshot"
cask "daisydisk"
cask "dash"
cask "discord"
cask "dropbox"
cask "epic-games"
cask "fantastical"
cask "figma"
cask "firefox"
cask "flipper"
cask "godot"
cask "insomnia"
cask "istat-menus"
cask "itch"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "love"
cask "obsidian"
cask "postico"
cask "react-native-debugger"
cask "reaper"
cask "slack"
cask "spotify"
cask "statusfy"
cask "unity-hub"
cask "virtualbox"
cask "wireshark"
cask "xscreensaver"
cask "zoom"

mas "Capo", id: 696977615
mas "GarageBand", id: 682658836
mas "Harvest", id: 506189836
mas "Xcode", id: 497799835
