# ==========================================================
# Taps
# ----------------------------------------------------------
tap "anomalyco/tap"
tap "charmbracelet/tap"

{{- if eq .chezmoi.os "darwin" }}
tap "d12frosted/emacs-plus"
tap "morantron/tmux-fingers"
{{ end }}

{{- if eq .chezmoi.hostname "Joulie" }}
tap "timescale/tap"
{{- end }}

# ==========================================================
# Formulae
# ----------------------------------------------------------
brew "atuin"
brew "awscli"
brew "bash"
brew "bash-language-server"
brew "bat"
brew "bob"
brew "bottom"
brew "difftastic"
brew "dust"
brew "eslint_d"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fish-lsp"
brew "flyctl"
brew "fnlfmt"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "gnupg"
brew "gpg-tui"
brew "gs"
brew "gum"
brew "htop"
brew "httpie"
brew "jq"
brew "lazygit"
brew "luajit"
brew "mise"
brew "nmap"
brew "ossp-uuid"
brew "pgformatter"
brew "pkgconf"
brew "pyright"
brew "readline"
brew "rg"
brew "sd"
brew "sleek"
brew "sqlfluff"
brew "starship"
brew "stylelint"
brew "tldr"
brew "tmux"
brew "tmuxp"
brew "tree"
brew "tree-sitter"
brew "uv"
brew "vale"
brew "w3m"
brew "watchexec"
brew "websocat"
brew "yazi"
brew "zellij"
brew "zoxide"

{{- if eq .chezmoi.os "darwin" }}
brew "anomalyco/tap/opencode"
brew "colima"
brew "curl"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "dockutil"
brew "exercism"
brew "fabric-ai"
brew "frpc"
brew "gcc"
brew "gomplate"
brew "icu4c@77"
brew "imagemagick"
brew "jackielii/tap/skhd-zig"
brew "lgug2z/tap/komorebi-for-mac"
brew "libgccjit"
brew "libressl"
brew "llvm"
brew "mas"
brew "mermaid-cli"
brew "morantron/tmux-fingers/tmux-fingers"
brew "pngpaste"
brew "soft-serve"
brew "tio"
brew "zlib"
brew "xmlstarlet"
{{ end }}

{{- if eq .chezmoi.hostname "Weatherwax" }}
brew "libpq"
{{ end }}

{{- if eq .chezmoi.hostname "Joulie" }}
brew "cairo"
brew "coreutils"
brew "exiftool"
brew "fwup"
brew "gtk+3"
brew "openjdk@17"
brew "pkg-config"
brew "postgresql@17"
brew "squashfs"
brew "timescaledb"
brew "timescaledb-toolkit"
brew "xz"
{{ end }}

{{- if eq .chezmoi.hostname "bienjensu" }}
brew "frps"
{{ end }}

# ==========================================================
# Casks
# ----------------------------------------------------------
{{- if eq .chezmoi.os "darwin" }}
cask "1password"
cask "1password-cli"
cask "amethyst"
cask "appcleaner"
cask "arc"
cask "cleanshot"
cask "daisydisk"
cask "discord"
cask "dropbox"
cask "emacs-plus-app"
cask "fantastical"
cask "figma"
cask "firefox"
cask "ghostty"
cask "gpg-suite-no-mail"
cask "hammerspoon"
cask "homerow"
cask "istat-menus"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "livebook"
cask "ngrok"
cask "obsidian"
cask "opal-composer"
cask "postico"
cask "postman"
cask "raycast"
cask "utm"
cask "vlc"
cask "zed"
{{ end }}

{{- if eq .chezmoi.hostname "Weatherwax" }}
cask "affinity"
cask "blender"
cask "epic-games"
cask "godot"
cask "magicavoxel"
cask "obs"
cask "playdate-simulator"
cask "steam"
{{ end }}

{{- if eq .chezmoi.hostname "Joulie" }}
cask "microsoft-office"
{{ end }}

# ==========================================================
# Mac App Store
# ----------------------------------------------------------
{{- if eq .chezmoi.hostname "Weatherwax" }}
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "iA Writer", id: 775737590
mas "Kagi for Safari", id: 1622835804
mas "keymapp", id: 6472865291
mas "Klack", id: 6446206067
mas "Logic Pro", id: 634148309
mas "Save to Reader", id: 1640236961
{{ end }}

{{- if eq .chezmoi.hostname "Joulie" }}
mas "Transporter", id: 1450874784
{{ end }}

# vim:ft=conf
